## staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                              |
|----------|----------------------------------------------------------------|
| update   | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s` |
| recreate | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
17:28:08.770 STDOUT terraform:   ~ update in-place
17:28:08.770 STDOUT terraform: -/+ destroy and then create replacement
17:28:08.770 STDOUT terraform: Terraform will perform the following actions:
17:28:08.770 STDOUT terraform:   # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
17:28:08.770 STDOUT terraform:   ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
17:28:08.770 STDOUT terraform:         id                     = "notification-canada-ca-staging-eks-cluster:notification-canada-ca-staging-eks-primary-node-group-k8s"
17:28:08.770 STDOUT terraform:       ~ release_version        = "1.33.3-20250813" -> "1.33.3-20250819"
17:28:08.770 STDOUT terraform:         tags                   = {
17:28:08.770 STDOUT terraform:             "CostCenter"             = "notification-canada-ca-staging"
17:28:08.770 STDOUT terraform:             "Name"                   = "notification-canada-ca"
17:28:08.770 STDOUT terraform:             "karpenter.sh/discovery" = "notification-canada-ca-staging-eks-cluster"
17:28:08.770 STDOUT terraform:         }
17:28:08.770 STDOUT terraform:         # (17 unchanged attributes hidden)
17:28:08.770 STDOUT terraform:         # (3 unchanged blocks hidden)
17:28:08.770 STDOUT terraform:     }
17:28:08.770 STDOUT terraform:   # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
17:28:08.770 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
17:28:08.771 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:EKS_KARPENTER_AMI_ID-RMKHzX" -> (known after apply)
17:28:08.771 STDOUT terraform:       + has_secret_string_wo = (known after apply)
17:28:08.771 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:EKS_KARPENTER_AMI_ID-RMKHzX|terraform-20250818145114051900000002" -> (known after apply)
17:28:08.771 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
17:28:08.771 STDOUT terraform:       ~ version_id           = "terraform-20250818145114051900000002" -> (known after apply)
17:28:08.771 STDOUT terraform:       ~ version_stages       = [
17:28:08.771 STDOUT terraform:           - "AWSCURRENT",
17:28:08.771 STDOUT terraform:         ] -> (known after apply)
17:28:08.771 STDOUT terraform:         # (4 unchanged attributes hidden)
17:28:08.771 STDOUT terraform:     }
17:28:08.771 STDOUT terraform: Plan: 1 to add, 1 to change, 1 to destroy.
17:28:08.772 STDOUT terraform: Warning: Deprecated attribute
17:28:08.772 STDOUT terraform:   on .terraform/modules/sentinel_forwarder/sentinel_forwarder/main.tf line 85, in resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription":
17:28:08.772 STDOUT terraform:   85:   principal     = "logs.${data.aws_region.current.name}.amazonaws.com"
17:28:08.772 STDOUT terraform: The attribute "name" is deprecated. Refer to the provider documentation for
17:28:08.772 STDOUT terraform: details.
17:28:08.772 STDOUT terraform: (and 3 more similar warnings elsewhere)
17:28:08.772 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
17:28:08.772 STDOUT terraform: Saved the plan to: plan.tfplan
17:28:08.772 STDOUT terraform: To perform exactly these actions, run the following command to apply:
17:28:08.772 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.oom-errors[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
